jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
#if USE_RX_DMA_FOR_CHIP && USE_RULOS_DMA_FOR_UART

/*
 * G4 (and future migrated families) drive RX DMA through the RULOS DMA
 * abstraction. The channel is allocated once at hal_uart_init time;
 * each half-buffer rx restart just reprograms the addresses and
 * restarts via rulos_dma_start.
 */
static void hal_uart_on_rx_dma_tc(void *user_data);

static void hal_uart_start_rx_dma(stm32_uart_t *u,
                                  const stm32_uart_config_t *config) {
  LL_USART_EnableDMAReq_RX(config->instance);
  rulos_dma_start(u->rx_dma_ch,
                  (volatile void *)LL_USART_DMA_GetRegAddr(
                      config->instance, LL_USART_DMA_REG_DATA_RECEIVE),
                  u->rx_curr_base_buf, u->rx_half_buflen);
}

// TC callback from the RULOS DMA core. Runs in DMA IRQ context. The
// user_data pointer encodes the RULOS uart_id.
static void hal_uart_on_rx_dma_tc(void *user_data) {
  uint8_t uart_id = (uint8_t)(uintptr_t)user_data;
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
  if (!u->initted) {
    return;
  }
  u->tot_ints++;
  u->tot_rx_bytes += u->rx_half_buflen;
  on_rx_buffer_full(uart_id, u, config);
}

static size_t get_rx_stored_chars_dma(uint8_t uart_id, stm32_uart_t *u,
                                      const stm32_uart_config_t *c) {
  (void)c;
  rulos_dma_stop(u->rx_dma_ch);
  const size_t free_space = rulos_dma_get_remaining(u->rx_dma_ch);
  const size_t rx_chars = u->rx_half_buflen - free_space;
  u->tot_rx_bytes += rx_chars;
  return rx_chars;
}

#elif USE_RX_DMA_FOR_CHIP  // legacy LL-direct RX DMA path (still used on G0)

static void hal_uart_start_rx_dma(stm32_uart_t *u,
                                  const stm32_uart_config_t *config) {
  LL_DMA_DisableChannel(config->rx_dma_instance, config->rx_dma_channel);

  // Enable DMA RX interrupts
  NVIC_SetPriority(config->rx_dma_irqn, 1);
  NVIC_EnableIRQ(config->rx_dma_irqn);

  LL_DMA_ClearFlag_TC(config->rx_dma_instance, config->rx_dma_channel);
  LL_DMA_ConfigTransfer(config->rx_dma_instance, config->rx_dma_channel,
                        LL_DMA_DIRECTION_PERIPH_TO_MEMORY |
                            LL_DMA_PRIORITY_MEDIUM | LL_DMA_MODE_NORMAL |
                            LL_DMA_PERIPH_NOINCREMENT |
                            LL_DMA_MEMORY_INCREMENT | LL_DMA_PDATAALIGN_BYTE |
                            LL_DMA_MDATAALIGN_BYTE);

  LL_DMA_ConfigAddresses(
      config->rx_dma_instance, config->rx_dma_channel,
      LL_USART_DMA_GetRegAddr(config->instance, LL_USART_DMA_REG_DATA_RECEIVE),
      (uint32_t)u->rx_curr_base_buf,
      LL_DMA_GetDataTransferDirection(config->rx_dma_instance,
                                      config->rx_dma_channel));
  LL_DMA_SetDataLength(config->rx_dma_instance, config->rx_dma_channel,
                       u->rx_half_buflen);
  LL_DMA_SetPeriphRequest(config->rx_dma_instance, config->rx_dma_channel,
                          config->rx_dma_request);
  LL_DMA_EnableIT_TC(config->rx_dma_instance, config->rx_dma_channel);
  LL_USART_EnableDMAReq_RX(config->instance);
  LL_DMA_EnableChannel(config->rx_dma_instance, config->rx_dma_channel);
}

// Called when a DMA interrupt arrives for a UART. Determine if it is a
// completion interrupt, and if so, send an upcall.
static void on_rx_dma_interrupt(uint8_t uart_id) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];

  if (!u->initted) {
    return;
  }

  u->tot_ints++;

  if (LL_DMA_IsActiveFlag_TC(config->rx_dma_instance, config->rx_dma_channel)) {
    LL_DMA_ClearFlag_TC(config->rx_dma_instance, config->rx_dma_channel);
    u->tot_rx_bytes += u->rx_half_buflen;
    on_rx_buffer_full(uart_id, u, config);
  }
}

static size_t get_rx_stored_chars_dma(uint8_t uart_id, stm32_uart_t *u,
                                      const stm32_uart_config_t *c) {
  // Disable DMA
  LL_DMA_DisableChannel(c->rx_dma_instance, c->rx_dma_channel);

  // Determine how many bytes are left to read, and thus how many were read
  const size_t free_space =
      LL_DMA_GetDataLength(c->rx_dma_instance, c->rx_dma_channel);
  const size_t rx_chars = u->rx_half_buflen - free_space;
  u->tot_rx_bytes += rx_chars;
  return rx_chars;
}

#else  // USE_RX_DMA_FOR_CHIP

static void hal_uart_start_rx_dma(stm32_uart_t *u,
                                  const stm32_uart_config_t *config) {
}

static size_t get_rx_stored_chars_dma(uint8_t uart_id, stm32_uart_t *u,
                                      const stm32_uart_config_t *c) {
  return 0;
}

#endif  // USE_RX_DMA_FOR_CHIP

//// Receiving: Per-Char Interrupt Version

static void hal_uart_start_rx_interrupt(stm32_uart_t *u,
                                        const stm32_uart_config_t *config) {
  LL_USART_EnableIT_RXNE(config->instance);
}

static void receive_char_int(uint8_t uart_id, stm32_uart_t *u,
                             const stm32_uart_config_t *config, char c) {
  // store the character
  u->rx_curr_base_buf[u->rx_bytes_stored] = c;
  u->rx_bytes_stored++;
  u->tot_rx_bytes++;

  // if the half-buffer has filled, make an upcall
  if (u->rx_bytes_stored == u->rx_half_buflen) {
    on_rx_buffer_full(uart_id, u, config);
  }
}

static size_t get_rx_stored_chars_int(uint8_t uart_id, stm32_uart_t *u,
                                      const stm32_uart_config_t *c) {
  return u->rx_bytes_stored;
}

//// Receiving: shared between DMA and Per-Char

static char *switch_rx_buffers(stm32_uart_t *u) {
  char *oldbuf = u->rx_curr_base_buf;
  if (oldbuf == u->rx_buf) {
    u->rx_curr_base_buf += u->rx_half_buflen;
  } else {
    u->rx_curr_base_buf = u->rx_buf;
  }
  u->rx_bytes_stored = 0;
  u->rx_data_ready = false;
  return oldbuf;
}

static void launch_next_rx(stm32_uart_t *u, const stm32_uart_config_t *config) {
  // launch a read on that buffer
  if (USART_USING_RX_DMA(config)) {
    hal_uart_start_rx_dma(u, config);
  } else {
    hal_uart_start_rx_interrupt(u, config);
  }
}

static void rx_send_up(uint8_t uart_id, stm32_uart_t *u, char *buf,
                       size_t len) {
  assert(u->rx_cb_ready);
  if (len > 0) {
    u->rx_cb_ready = false;
    u->rx_cb(uart_id, u->user_data, buf, len);
    if (len > u->max_chars_per_rx_batch) {
      u->max_chars_per_rx_batch = len;
    }
  }
}

// Maybe flush the RX buffer -- if there's data, and the upper layer is ready to
// receive
static void maybe_flush_rx_buf(uint8_t uart_id, stm32_uart_t *u,
                               const stm32_uart_config_t *c) {
  if (!u->rx_cb_ready) {
    return;
  }

  if (!u->rx_data_ready) {
    return;
  }

  size_t len = 0;
  if (USART_USING_RX_DMA(c)) {
    len = get_rx_stored_chars_dma(uart_id, u, c);
    //LOG("dma uart %d: got %u", uart_id, len);
  } else {
    len = get_rx_stored_chars_int(uart_id, u, c);
    //LOG("int uart %d: got %u", uart_id, len);
  }

