jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
  char *oldbuf = switch_rx_buffers(u);
  launch_next_rx(u, c);
  rx_send_up(uart_id, u, oldbuf, len);
}

static void on_rx_buffer_full(uint8_t uart_id, stm32_uart_t *u,
                              const stm32_uart_config_t *c) {
  // RX buffer is full, so we better be done processing the other one! Otherwise
  // we have to drop it.
  if (!u->rx_cb_ready) {
    // uh oh! we can't send the buffer up because the previous upcall is still
    // outstanding. no choice but to lose the data.
    u->dropped_rx_bytes += u->rx_half_buflen;
    u->rx_bytes_stored = 0;
  } else {
    char *oldbuf = switch_rx_buffers(u);
    rx_send_up(uart_id, u, oldbuf, u->rx_half_buflen);
  }
  launch_next_rx(u, c);
}

void hal_uart_start_rx(uint8_t uart_id, hal_uart_receive_cb rx_cb, void *buf,
                       size_t buflen) {
  /*
   * Use the Low-Level libraries (not the HAL) to set up the RX interrupt. Yeah,
   * it's a little weird to be using a mix of both HAL and LL. I wanted to use
   * the HAL libraries for the TX DMA, since it's complex. For RX, the HAL
   * libraries don't really do what we want - you have to give them a total
   * length you want to read, and then it shuts everything down again. We want
   * to just start receiving and never stop, with a simple interrupt every time
   * we receive a character.
   */
  assert(uart_id < NUM_UARTS);
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
  if (!u->rx_gpio_initted) {
    config_gpio(config, true);
    u->rx_gpio_initted = true;
  }

  u->rx_cb = rx_cb;
  u->rx_buf = buf;
  u->rx_curr_base_buf = u->rx_buf;
  u->rx_half_buflen = buflen / 2;
  u->rx_cb_ready = true;

  // If the hardware supports a UART FIFO, enable it
#ifdef LL_USART_ISR_RXNE_RXFNE
  LL_USART_EnableFIFO(config->instance);
#endif

  // clear spurious char that might be sitting in the rx register
  LL_USART_ReceiveData8(config->instance);

  // Enable the idle interrupt so we can flush rx buffers upwards when each
  // message ends
  LL_USART_ClearFlag_IDLE(config->instance);
  LL_USART_EnableIT_IDLE(config->instance);
  launch_next_rx(u, config);
}

static void on_usart_interrupt(uint8_t uart_id) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *c = &stm32_uart_config[uart_id];
  if (!u->initted) {
    return;
  }

  u->tot_ints++;

  // if this uart is expecting to rx, and a character arrived, add it to the rx
  // buffer
  if (u->rx_buf) {
      int num_read = 0;
      while (u->rx_buf && LL_USART_IsActiveFlag_RXNE(c->instance)) {
        // note: we have to read the character whether or not we send it anywhere;
        // reading the char is what clears the interrupt
        num_read++;
        receive_char_int(uart_id, u, c, LL_USART_ReceiveData8(c->instance));
      }

      // If we read anything, update some statistics
      if (num_read > 0) {
        if (num_read > u->max_chars_per_rx_isr) {
          u->max_chars_per_rx_isr = num_read;
        }
        if (u->min_chars_per_rx_isr == 0 || num_read < u->min_chars_per_rx_isr) {
          u->min_chars_per_rx_isr = num_read;
        }
      }
  }

  // on idle interrupt, flush the rx buffers upwards
  if (LL_USART_IsActiveFlag_IDLE(c->instance)) {
    LL_USART_ClearFlag_IDLE(c->instance);
    u->idle_ints++;
    u->rx_data_ready = true;
    maybe_flush_rx_buf(uart_id, u, c);
  }

  // handle RX errors by clearing flags and updating statistics
  if (LL_USART_IsActiveFlag_FE(c->instance)) {
    LL_USART_ClearFlag_FE(c->instance);
    u->frame_errors++;
  }
  if (LL_USART_IsActiveFlag_PE(c->instance)) {
    LL_USART_ClearFlag_PE(c->instance);
    u->parity_errors++;
  }
  if (LL_USART_IsActiveFlag_NE(c->instance)) {
    LL_USART_ClearFlag_NE(c->instance);
    u->noise_errors++;
  }
  if (LL_USART_IsActiveFlag_ORE(c->instance)) {
    LL_USART_ClearFlag_ORE(c->instance);
    u->overruns++;
  }

#if !USE_RULOS_DMA_FOR_UART
  // Dispatch the rest of the interrupt handling through the HAL. On
  // families that use the RULOS DMA abstraction this call is dropped
  // entirely -- the HAL UART handle no longer exists on those families,
  // and every flag the HAL handler would act on is already cleared
  // above (TXE/TC/RXFT are never enabled since TX is DMA-driven and
  // RX is either DMA or RXNE-driven).
  HAL_UART_IRQHandler(&u->hal_uart_handle);
#endif
}

void hal_uart_rx_cb_done(uint8_t uart_id) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *c = &stm32_uart_config[uart_id];

  rulos_irq_state_t irq = hal_start_atomic();
  assert(!u->rx_cb_ready);
  u->rx_cb_ready = true;
  maybe_flush_rx_buf(uart_id, u, c);
  hal_end_atomic(irq);
}

/////// transmission

#if !USE_RULOS_DMA_FOR_UART
static void dispatch_tx_dma(uint8_t uart_id) {
  const stm32_uart_t *u = &g_stm32_uarts[uart_id];
  if (!u->initted) {
    return;
  }

  HAL_DMA_IRQHandler(u->hal_uart_handle.hdmatx);
}
#endif

static void maybe_launch_next_tx(stm32_uart_t *uart) {
  assert(uart->next_sendbuf_cb != NULL);
#if !USE_RULOS_DMA_FOR_UART
  assert(HAL_UART_GetState(&uart->hal_uart_handle) == HAL_UART_STATE_READY);
#endif

  // Ask the layer above for the next buffer to send by calling the "send ready"
  // callback
  const char *buf;
  uint16_t len;
  uart->next_sendbuf_cb(uart->uart_id, uart->user_data, &buf, &len);

  if (len == 0) {
    // tx train complete!
    uart->next_sendbuf_cb = NULL;
  } else {
    // Start the transfer
#if USE_RULOS_DMA_FOR_UART
    rulos_dma_start(uart->tx_dma_ch, uart->usart_tdr, (void *)buf, len);
#else
    if (HAL_UART_Transmit_DMA(&uart->hal_uart_handle, (uint8_t *)buf, len) !=
        HAL_OK) {
      __builtin_trap();
    }
#endif
    uart->tot_tx_bytes += len;
    if (len > uart->max_chars_per_tx_batch) {
      uart->max_chars_per_tx_batch = len;
    }
  }
}

#if USE_RULOS_DMA_FOR_UART
// TC callback from the RULOS DMA core. Runs in DMA IRQ context. The
// user_data pointer encodes the RULOS uart_id.
static void hal_uart_on_tx_dma_tc(void *user_data) {
  uint8_t uart_id = (uint8_t)(uintptr_t)user_data;
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  if (!u->initted) {
    return;
  }
  // Re-arm if there's more data queued upstream.
  if (u->next_sendbuf_cb != NULL) {
    maybe_launch_next_tx(u);
  }
}
#else
// Callback called when TX is complete. This overrides a weak symbol in the HAL
// implementation.
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *hal_uart_handle) {
  for (unsigned int i = 0; i < NUM_UARTS; i++) {
    if (&g_stm32_uarts[i].hal_uart_handle == hal_uart_handle) {
      maybe_launch_next_tx(&g_stm32_uarts[i]);
    }
  }
}
#endif

void hal_uart_start_send(uint8_t uart_id, hal_uart_next_sendbuf_cb cb) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  if (!u->tx_gpio_initted) {
    const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
    config_gpio(config, false);
    u->tx_gpio_initted = true;
  }
  assert(u->next_sendbuf_cb == NULL);
  u->next_sendbuf_cb = cb;
  maybe_launch_next_tx(u);
}

///// initialization

